Revit 2027 API
BuiltInFailures.ExtrusionFailures.ExtrusionTooThin Property
 Extrusion is too thin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ExtrusionTooThin { get; }
Public Shared ReadOnly Property ExtrusionTooThin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ExtrusionTooThin {
	FailureDefinitionId^ get ();
}
static member ExtrusionTooThin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ExtrusionFailures Class
Autodesk.Revit.DB Namespace